docs/documentation.org
#+TITLE: Auth and user management documentation
#+AUTHOR: Tooraj Taraz
#+OPTIONS: ^:nil _:nil
#+SETUPFILE: ~/.doom.d/retro-dark.theme


* Auth endpoint
** Description
Using these endpoints users can create an account, sing in into their account, sign out and revoke their tokens and finally refresh their used access_token. We implement a simple access model, each resource a.k.a (path, method) tuple has an integer access level, each user also has an integer access level, users can access resources with lower access level than their own access level.
On a successful sign in user receives two tokens, one for accessing resources with access level higher than 0, and another for refreshing expired or used access token. Each token regardless of its type can only be used once. After a successful refresh user receives a brand new token couple. Access tokens expire within 10 seconds and Refresh tokens expire within a day. Users have to re-login on refresh token expiration.
*** sign_in
- path: /api/auth/sign_in
- method: POST
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/signin.schema.json",
    "title": "SignIn",
    "description": "Sign in form",
    "type": "object",
    "properties": {
        "email": {
            "description": "User's email",
            "type": "string",
            "format": "email"
        },
        "password": {
            "description": "User's password",
            "type": "string",
                "minLength": 8,
                "maxLength": 128
        }
    },
    "required": [ "email", "password" ]
}
  #+END_SRC
- example 401:
  - body:
    #+BEGIN_SRC json
{
    "email": "nono@nono.com",
    "password": "nonononononono"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "wrong password or email"
    ]
}
    #+END_SRC
- example 200:
  - body:
    #+BEGIN_SRC json
{
    "email": "test@test.com",
    "password": "testtest"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "access_token": "token_for_access",
    "refresh_token": "token_for_refresh"
}
    #+END_SRC

*** sign_up
- path: /api/auth/sign_up
- method: POST
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/signup.schema.json",
    "title": "SignUp",
    "description": "Sign up form",
    "type": "object",
    "properties": {
        "email": {
            "description": "User's email",
            "type": "string",
            "format": "email"
        },
        "password": {
            "description": "User's password",
            "type": "string",
                "minLength": 8,
                "maxLength": 128
        },
        "first_name": {
            "description": "User's name",
            "type": "string"
        },
        "first_name": {
            "description": "User's last name",
            "type": "string"
        }
    },
    "required": [ "email", "password", "first_name", "last_name"]
}
  #+END_SRC
- example 400:
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test",
    "last_name": "test",
    "email": "test@test.com",
    "password": "testtest"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "User already exists."
    ]
}
    #+END_SRC
- example 400:
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test",
    "last_name": "test",
    "email": "test_badmail.com",
    "password": "testtest"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "\"test_badmail.com\" is not a \"email\""
    ]
}
    #+END_SRC
- example 200:
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test",
    "last_name": "test",
    "email": "testttseqwettt@test.com",
    "password": "testtest"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "message": "Your account was created successfully, use login api to get auth token"
}
    #+END_SRC

