docs/documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-06 Fri 23:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Auth and user management documentation</title>
<meta name="author" content="Tooraj Taraz" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Auth and user management documentation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org84c7479">1. Auth endpoint</a>
<ul>
<li><a href="#org98c4c95">1.1. Description</a>
<ul>
<li><a href="#org81e4946">1.1.1. sign_in</a></li>
<li><a href="#org43137b5">1.1.2. sign_up</a></li>
<li><a href="#orgb75a8ca">1.1.3. sign_out</a></li>
<li><a href="#orgb12b05d">1.1.4. refresh</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgddef8a3">2. Users endpoint</a>
<ul>
<li><a href="#org93d24a5">2.1. Description</a>
<ul>
<li><a href="#org5112646">2.1.1. Create a user (admin)</a></li>
<li><a href="#org48dc304">2.1.2. Delete account (normal user)</a></li>
<li><a href="#orgde2f6d4">2.1.3. Delete user (admin)</a></li>
<li><a href="#org8966e51">2.1.4. Update account (normal user)</a></li>
<li><a href="#org2b74982">2.1.5. Update user (admin)</a></li>
<li><a href="#orgfd5df43">2.1.6. Get users (admin)</a></li>
<li><a href="#org4fcf78a">2.1.7. Get one user (admin)</a></li>
<li><a href="#orgb7bd725">2.1.8. Get my account (normal user)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge0044c7">3. GRPC server</a>
<ul>
<li><a href="#org64862cc">3.1. Protocol</a>
<ul>
<li><a href="#org349b7ac">3.1.1. HasAccess</a></li>
<li><a href="#org046ad1d">3.1.2. GetUser</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org84c7479" class="outline-2">
<h2 id="org84c7479"><span class="section-number-2">1.</span> Auth endpoint</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org98c4c95" class="outline-3">
<h3 id="org98c4c95"><span class="section-number-3">1.1.</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Using these endpoints users can create an account, sing in into their account, sign out and revoke their tokens and finally refresh their used access_token. We implement a simple access model, each resource a.k.a (path, method) tuple has an integer access level, each user also has an integer access level, users can access resources with lower access level than their own access level.
On a successful sign in user receives two tokens, one for accessing resources with access level higher than 0, and another for refreshing expired or used access token. Each token regardless of its type can only be used once. After a successful refresh user receives a brand new token couple. Access tokens expire within 10 seconds and Refresh tokens expire within a day. Users have to re-login on refresh token expiration.
</p>
</div>
<div id="outline-container-org81e4946" class="outline-4">
<h4 id="org81e4946"><span class="section-number-4">1.1.1.</span> sign_in</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>path: /api/auth/sign_in</li>
<li>method: POST</li>
<li>content-type: application/json</li>
<li><p>
validation schema:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"$schema"</span>: <span style="color: #c3e88d;">"https://json-schema.org/draft/2020-12/schema"</span>,
    <span style="color: #c099ff;">"$id"</span>: <span style="color: #c3e88d;">"https://cloud.project/signin.schema.json"</span>,
    <span style="color: #c099ff;">"title"</span>: <span style="color: #c3e88d;">"SignIn"</span>,
    <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"Sign in form"</span>,
    <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"object"</span>,
    <span style="color: #c099ff;">"properties"</span>: {
        <span style="color: #c099ff;">"email"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's email"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
            <span style="color: #c099ff;">"format"</span>: <span style="color: #c3e88d;">"email"</span>
        },
        <span style="color: #c099ff;">"password"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's password"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
                <span style="color: #c099ff;">"minLength"</span>: <span style="color: #ff995e; font-weight: bold;">8</span>,
                <span style="color: #c099ff;">"maxLength"</span>: <span style="color: #ff995e; font-weight: bold;">128</span>
        }
    },
    <span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"email"</span>, <span style="color: #c3e88d;">"password"</span> ]
}
</pre>
</div></li>
<li>example 401:
<ul class="org-ul">
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"nono@nono.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"nonononononono"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"wrong password or email"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"access_token"</span>: <span style="color: #c3e88d;">"token_for_access"</span>,
    <span style="color: #c099ff;">"refresh_token"</span>: <span style="color: #c3e88d;">"token_for_refresh"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org43137b5" class="outline-4">
<h4 id="org43137b5"><span class="section-number-4">1.1.2.</span> sign_up</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>path: /api/auth/sign_up</li>
<li>method: POST</li>
<li>content-type: application/json</li>
<li><p>
validation schema:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"$schema"</span>: <span style="color: #c3e88d;">"https://json-schema.org/draft/2020-12/schema"</span>,
    <span style="color: #c099ff;">"$id"</span>: <span style="color: #c3e88d;">"https://cloud.project/signup.schema.json"</span>,
    <span style="color: #c099ff;">"title"</span>: <span style="color: #c3e88d;">"SignUp"</span>,
    <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"Sign up form"</span>,
    <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"object"</span>,
    <span style="color: #c099ff;">"properties"</span>: {
        <span style="color: #c099ff;">"email"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's email"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
            <span style="color: #c099ff;">"format"</span>: <span style="color: #c3e88d;">"email"</span>
        },
        <span style="color: #c099ff;">"password"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's password"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
                <span style="color: #c099ff;">"minLength"</span>: <span style="color: #ff995e; font-weight: bold;">8</span>,
                <span style="color: #c099ff;">"maxLength"</span>: <span style="color: #ff995e; font-weight: bold;">128</span>
        },
        <span style="color: #c099ff;">"first_name"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's name"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>
        },
        <span style="color: #c099ff;">"first_name"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's last name"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>
        }
    },
    <span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"email"</span>, <span style="color: #c3e88d;">"password"</span>, <span style="color: #c3e88d;">"first_name"</span>, <span style="color: #c3e88d;">"last_name"</span>]
}
</pre>
</div></li>
<li>example 400:
<ul class="org-ul">
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"User already exists."</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 400:
<ul class="org-ul">
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test_badmail.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"\"test_badmail.com\" is not a \"email\""</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"testttseqwettt@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"Your account was created successfully, use login api to get auth token"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
