docs/documentation.org
*** sign_out
- path: /api/auth/sign_in
- method: POST
- header: Authorization Bearer <access_token>
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/signout.schema.json",
    "title": "SignOut",
    "description": "Sign out form",
    "type": "object",
    "properties": {
        "refresh_token": {
            "description": "User's valid refresh token",
            "type": "string",
        },
    },
    "required": [ "refresh_token" ]
}
  #+END_SRC
- example 401:
  - invalid token within header
  - body:
    #+BEGIN_SRC json
{
    "refresh_token": "refresh_token"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 200:
  - valid token in header and body
  - body:
    #+BEGIN_SRC json
{
    "refresh_token": "refresh_token"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "Message": "Sing out was successful."
}
    #+END_SRC


*** refresh
- note : Users can not use this endpoint prior to access token expiration.
- path: /api/auth/refresh
- method: POST
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/refresh.schema.json",
    "title": "Refresh",
    "description": "Refresh token form",
    "type": "object",
    "properties": {
        "refresh_token": {
            "description": "User's valid refresh token",
            "type": "string",
        },
    },
    "required": [ "refresh_token" ]
}
  #+END_SRC
- example 200:
  - body:
    #+BEGIN_SRC json
{
    "refresh_token": "refresh_token"
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "access_token": "token_for_access",
    "refresh_token": "token_for_refresh"
}
    #+END_SRC
* Users endpoint
** Description
Some of these endpoints are only available to admin. Users can update their account, actions like changing their email, password or name and last_name. Admins can retrieve list of users, filter them, or get one specific user by their ID. Admins can also update or delete users accounts.
*** Create a user (admin)
- note : admins can not create users with higher access level than theirs
- path: /api/users
- method: POST
- header: Authorization Bearer <access_token>
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/create.schema.json",
    "title": "Create",
    "description": "Admin's Create user form",
    "type": "object",
    "properties": {
        "email": {
            "description": "User's email",
            "type": "string",
            "format": "email"
        },
        "password": {
            "description": "User's password",
            "type": "string",
                "minLength": 8,
                "maxLength": 128
        },
        "first_name": {
            "description": "User's name",
            "type": "string"
        },
        "first_name": {
            "description": "User's last name",
            "type": "string"
        },
        "access_level": {
            "description" : "User's access level",
            "type" : "integer",
            "minimum" : 0
        }
    },
    "required": [ "email", "password", "first_name", "last_name", "access_level"]
}
  #+END_SRC
- example 401:
  - invalid token within header or user with non admin access level
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test18",
    "last_name": "test18",
    "email": "test109@test.com",
    "password": "testtest",
    "access_level": 1
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 200:
  - valid token in header with admin access level
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
    "access_level": 1
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "message": "User was created successfully"
}
    #+END_SRC
