docs/documentation.html

<div id="outline-container-orgb75a8ca" class="outline-4">
<h4 id="orgb75a8ca"><span class="section-number-4">1.1.3.</span> sign_out</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>path: /api/auth/sign_in</li>
<li>method: POST</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>content-type: application/json</li>
<li><p>
validation schema:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"$schema"</span>: <span style="color: #c3e88d;">"https://json-schema.org/draft/2020-12/schema"</span>,
    <span style="color: #c099ff;">"$id"</span>: <span style="color: #c3e88d;">"https://cloud.project/signout.schema.json"</span>,
    <span style="color: #c099ff;">"title"</span>: <span style="color: #c3e88d;">"SignOut"</span>,
    <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"Sign out form"</span>,
    <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"object"</span>,
    <span style="color: #c099ff;">"properties"</span>: {
        <span style="color: #c099ff;">"refresh_token"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's valid refresh token"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
        },
    },
    <span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"refresh_token"</span> ]
}
</pre>
</div></li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"refresh_token"</span>: <span style="color: #c3e88d;">"refresh_token"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header and body</li>
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"refresh_token"</span>: <span style="color: #c3e88d;">"refresh_token"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"Message"</span>: <span style="color: #c3e88d;">"Sing out was successful."</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgb12b05d" class="outline-4">
<h4 id="orgb12b05d"><span class="section-number-4">1.1.4.</span> refresh</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>note : Users can not use this endpoint prior to access token expiration.</li>
<li>path: /api/auth/refresh</li>
<li>method: POST</li>
<li>content-type: application/json</li>
<li><p>
validation schema:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"$schema"</span>: <span style="color: #c3e88d;">"https://json-schema.org/draft/2020-12/schema"</span>,
    <span style="color: #c099ff;">"$id"</span>: <span style="color: #c3e88d;">"https://cloud.project/refresh.schema.json"</span>,
    <span style="color: #c099ff;">"title"</span>: <span style="color: #c3e88d;">"Refresh"</span>,
    <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"Refresh token form"</span>,
    <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"object"</span>,
    <span style="color: #c099ff;">"properties"</span>: {
        <span style="color: #c099ff;">"refresh_token"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's valid refresh token"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
        },
    },
    <span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"refresh_token"</span> ]
}
</pre>
</div></li>
<li>example 200:
<ul class="org-ul">
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"refresh_token"</span>: <span style="color: #c3e88d;">"refresh_token"</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"access_token"</span>: <span style="color: #c3e88d;">"token_for_access"</span>,
    <span style="color: #c099ff;">"refresh_token"</span>: <span style="color: #c3e88d;">"token_for_refresh"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgddef8a3" class="outline-2">
<h2 id="orgddef8a3"><span class="section-number-2">2.</span> Users endpoint</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org93d24a5" class="outline-3">
<h3 id="org93d24a5"><span class="section-number-3">2.1.</span> Description</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Some of these endpoints are only available to admin. Users can update their account, actions like changing their email, password or name and last_name. Admins can retrieve list of users, filter them, or get one specific user by their ID. Admins can also update or delete users accounts.
</p>
</div>
<div id="outline-container-org5112646" class="outline-4">
<h4 id="org5112646"><span class="section-number-4">2.1.1.</span> Create a user (admin)</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>note : admins can not create users with higher access level than theirs</li>
<li>path: /api/users</li>
<li>method: POST</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>content-type: application/json</li>
<li><p>
validation schema:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"$schema"</span>: <span style="color: #c3e88d;">"https://json-schema.org/draft/2020-12/schema"</span>,
    <span style="color: #c099ff;">"$id"</span>: <span style="color: #c3e88d;">"https://cloud.project/create.schema.json"</span>,
    <span style="color: #c099ff;">"title"</span>: <span style="color: #c3e88d;">"Create"</span>,
    <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"Admin's Create user form"</span>,
    <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"object"</span>,
    <span style="color: #c099ff;">"properties"</span>: {
        <span style="color: #c099ff;">"email"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's email"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
            <span style="color: #c099ff;">"format"</span>: <span style="color: #c3e88d;">"email"</span>
        },
        <span style="color: #c099ff;">"password"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's password"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
                <span style="color: #c099ff;">"minLength"</span>: <span style="color: #ff995e; font-weight: bold;">8</span>,
                <span style="color: #c099ff;">"maxLength"</span>: <span style="color: #ff995e; font-weight: bold;">128</span>
        },
        <span style="color: #c099ff;">"first_name"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's name"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>
        },
        <span style="color: #c099ff;">"first_name"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's last name"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>
        },
        <span style="color: #c099ff;">"access_level"</span>: {
            <span style="color: #c099ff;">"description"</span> : <span style="color: #c3e88d;">"User's access level"</span>,
            <span style="color: #c099ff;">"type"</span> : <span style="color: #c3e88d;">"integer"</span>,
            <span style="color: #c099ff;">"minimum"</span> : <span style="color: #ff995e; font-weight: bold;">0</span>
        }
    },
    <span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"email"</span>, <span style="color: #c3e88d;">"password"</span>, <span style="color: #c3e88d;">"first_name"</span>, <span style="color: #c3e88d;">"last_name"</span>, <span style="color: #c3e88d;">"access_level"</span>]
}
</pre>
</div></li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header or user with non admin access level</li>
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test18"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test18"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test109@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>,
    <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header with admin access level</li>
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test16"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test16"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test108@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>,
    <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"User was created successfully"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
