docs/documentation.org
*** Delete account (normal user)
- note: Deletes requesting user's account
- path: /api/users
- method: DELETE
- header: Authorization Bearer <access_token>
- example 401:
  - invalid token within header
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 200:
  - valid token in header with normal user access level
  - response:
    #+BEGIN_SRC json
{
    "message": "Your account was deleted successfully"
}
    #+END_SRC


*** Delete user (admin)
- note: Deletes requesting user's account
- path: /api/users/{id}
- path_params:
  - id: valid ObjectId string
- method: DELETE
- header: Authorization Bearer <access_token>
- example 401:
  - invalid token within header
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 404:
  - valid token in header with admin access level
  - valid id, but non existent
  - response:
    #+BEGIN_SRC json
{
    "message": "User does not exist."
}
    #+END_SRC
- example 200:
  - valid token in header with admin access level
  - response:
    #+BEGIN_SRC json
{
    "message": "User was deleted successfully"
}
    #+END_SRC

*** Update account (normal user)
- note: Updates requesting user's account
- path: /api/users
- method: PUT
- header: Authorization Bearer <access_token>
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/update.schema.json",
    "title": "Create",
    "description": "Admin's Create user form",
    "type": "object",
    "properties": {
        "email": {
            "description": "User's email",
            "type": "string",
            "format": "email"
        },
        "first_name": {
            "description": "User's name",
            "type": "string"
        },
        "password": {
            "description": "User's password",
            "type": "string",
                "minLength": 8,
                "maxLength": 128
        },
        "first_name": {
            "description": "User's last name",
            "type": "string"
        }
    },
    "anyOf" : [
        {"required": [ "email" ]},
        {"required": [ "password" ]},
        {"required": [ "first_name" ]},
        {"required": [ "last_name"]},
    ]
}
  #+END_SRC
- example 401:
  - invalid token within header
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 200:
  - valid token in header with normal user access level
  - provided email does not already exist in the DB
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "message": "Your account was updated successfully"
}
    #+END_SRC


