docs/documentation.html
<div id="outline-container-org48dc304" class="outline-4">
<h4 id="org48dc304"><span class="section-number-4">2.1.2.</span> Delete account (normal user)</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>note: Deletes requesting user&rsquo;s account</li>
<li>path: /api/users</li>
<li>method: DELETE</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header with normal user access level</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"Your account was deleted successfully"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgde2f6d4" class="outline-4">
<h4 id="orgde2f6d4"><span class="section-number-4">2.1.3.</span> Delete user (admin)</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>note: Deletes requesting user&rsquo;s account</li>
<li>path: /api/users/{id}</li>
<li>path_params:
<ul class="org-ul">
<li>id: valid ObjectId string</li>
</ul></li>
<li>method: DELETE</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 404:
<ul class="org-ul">
<li>valid token in header with admin access level</li>
<li>valid id, but non existent</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"User does not exist."</span>
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header with admin access level</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"User was deleted successfully"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8966e51" class="outline-4">
<h4 id="org8966e51"><span class="section-number-4">2.1.4.</span> Update account (normal user)</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>note: Updates requesting user&rsquo;s account</li>
<li>path: /api/users</li>
<li>method: PUT</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>content-type: application/json</li>
<li><p>
validation schema:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"$schema"</span>: <span style="color: #c3e88d;">"https://json-schema.org/draft/2020-12/schema"</span>,
    <span style="color: #c099ff;">"$id"</span>: <span style="color: #c3e88d;">"https://cloud.project/update.schema.json"</span>,
    <span style="color: #c099ff;">"title"</span>: <span style="color: #c3e88d;">"Create"</span>,
    <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"Admin's Create user form"</span>,
    <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"object"</span>,
    <span style="color: #c099ff;">"properties"</span>: {
        <span style="color: #c099ff;">"email"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's email"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
            <span style="color: #c099ff;">"format"</span>: <span style="color: #c3e88d;">"email"</span>
        },
        <span style="color: #c099ff;">"first_name"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's name"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>
        },
        <span style="color: #c099ff;">"password"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's password"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>,
                <span style="color: #c099ff;">"minLength"</span>: <span style="color: #ff995e; font-weight: bold;">8</span>,
                <span style="color: #c099ff;">"maxLength"</span>: <span style="color: #ff995e; font-weight: bold;">128</span>
        },
        <span style="color: #c099ff;">"first_name"</span>: {
            <span style="color: #c099ff;">"description"</span>: <span style="color: #c3e88d;">"User's last name"</span>,
            <span style="color: #c099ff;">"type"</span>: <span style="color: #c3e88d;">"string"</span>
        }
    },
    <span style="color: #c099ff;">"anyOf"</span> : [
        {<span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"email"</span> ]},
        {<span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"password"</span> ]},
        {<span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"first_name"</span> ]},
        {<span style="color: #c099ff;">"required"</span>: [ <span style="color: #c3e88d;">"last_name"</span>]},
    ]
}
</pre>
</div></li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test16"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test16"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test108@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>,
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header with normal user access level</li>
<li>provided email does not already exist in the DB</li>
<li><p>
body:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test16"</span>,
    <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test16"</span>,
    <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test108@test.com"</span>,
    <span style="color: #c099ff;">"password"</span>: <span style="color: #c3e88d;">"testtest"</span>,
}
</pre>
</div></li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"Your account was updated successfully"</span>
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
