docs/documentation.org
*** Update user (admin)
- note: Admins can not promote users to higher access level than theirs.
- path: /api/users/{id}
- path_params:
  - id: valid ObjectId string
- method: PUT
- header: Authorization Bearer <access_token>
- content-type: application/json
- validation schema:
  #+BEGIN_SRC json
{
    "$schema": "https://json-schema.org/draft/2020-12/schema",
    "$id": "https://cloud.project/admin.update.schema.json",
    "title": "Create",
    "description": "Admin's Create user form",
    "type": "object",
    "properties": {
        "email": {
            "description": "User's email",
            "type": "string",
            "format": "email"
        },
        "first_name": {
            "description": "User's name",
            "type": "string"
        },
        "password": {
            "description": "User's password",
            "type": "string",
                "minLength": 8,
                "maxLength": 128
        },
        "first_name": {
            "description": "User's last name",
            "type": "string"
        },
        "access_level": {
            "description" : "User's access level",
            "type" : "integer",
            "minimum" : 0
        }
    },
    "anyOf" : [
        {"required": [ "email" ]},
        {"required": [ "password" ]},
        {"required": [ "first_name" ]},
        {"required": [ "last_name"]},
        {"required": [ "access_level"]},
    ]
}
  #+END_SRC
- example 401:
  - invalid token within header
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
    "access_level": 1
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 400:
  - valid token in header with admin access level
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
    "access_level": 2000
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You can not promote user to higher access level than yours"
    ]
}
    #+END_SRC
- example 404:
  - valid token in header with admin access level
  - valid id, but non existent
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
    "access_level": 1
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "message": "User does not exist."
}
    #+END_SRC
- example 200:
  - valid token in header with admin access level
  - provided email does not already exist in the DB
  - body:
    #+BEGIN_SRC json
{
    "first_name": "test16",
    "last_name": "test16",
    "email": "test108@test.com",
    "password": "testtest",
    "access_level": 2
}
    #+END_SRC
  - response:
    #+BEGIN_SRC json
{
    "message": "User was updated successfully"
}
    #+END_SRC

