docs/documentation.org
*** Get users (admin)
- note: Gets users accounts filtered by query params
- path: /api/users
- method: GET
- query_params:
  - Deserialized version (no query param is required, all of them are optional):
    #+BEGIN_SRC rust
pub struct UserFilter {
    pub page: Option<u64>,
    pub size: Option<u64>,
    pub first_name: Option<String>,
    pub last_name: Option<String>,
    pub email: Option<String>,
    pub access_level: Option<i32>,
    pub access_level_cmp: Option<u8>,
}
    #+END_SRC
    - page : page number, defaults to 1
    - size : page size, defaults to 20
    - access_level_cmp : compare sign for access_level, (0 or greater than 4, ====), (1, >), (2, >=), (3, <), (4, <=)
    - access_level : user's access level
    - first_name : looks for any first_name that contains the param
    - last_name : looks for any first_name that contains the param
    - email : looks for any first_name that contains the param
- header: Authorization Bearer <access_token>
- example 401:
  - invalid token within header
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 200:
  - valid token in header with admin access level
  - response:
    #+BEGIN_SRC json
{
    "message": "Users retrieved successfully",
    "data": {
        "page": 1,
        "total_count": 836,
        "data": [
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b761b"
                },
                "first_name": "test178",
                "last_name": "test178",
                "email": "test178@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.389287970Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b761c"
                },
                "first_name": "test179",
                "last_name": "test179",
                "email": "test179@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.389724778Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b761d"
                },
                "first_name": "test166",
                "last_name": "test166",
                "email": "test166@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.390422573Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b761e"
                },
                "first_name": "test177",
                "last_name": "test177",
                "email": "test177@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.391446797Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b761f"
                },
                "first_name": "test176",
                "last_name": "test176",
                "email": "test176@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.421910615Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7620"
                },
                "first_name": "test186",
                "last_name": "test186",
                "email": "test186@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.440838222Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7621"
                },
                "first_name": "test181",
                "last_name": "test181",
                "email": "test181@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.440860209Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7622"
                },
                "first_name": "test187",
                "last_name": "test187",
                "email": "test187@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.440871354Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7623"
                },
                "first_name": "test183",
                "last_name": "test183",
                "email": "test183@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.454128680Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7624"
                },
                "first_name": "test185",
                "last_name": "test185",
                "email": "test185@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.465539934Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7625"
                },
                "first_name": "test189",
                "last_name": "test189",
                "email": "test189@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.472019516Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7626"
                },
                "first_name": "test180",
                "last_name": "test180",
                "email": "test180@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.472632670Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7627"
                },
                "first_name": "test188",
                "last_name": "test188",
                "email": "test188@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.493355320Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7628"
                },
                "first_name": "test191",
                "last_name": "test191",
                "email": "test191@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.521922589Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b7629"
                },
                "first_name": "test182",
                "last_name": "test182",
                "email": "test182@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.548845077Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b762a"
                },
                "first_name": "test193",
                "last_name": "test193",
                "email": "test193@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.569318707Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b762b"
                },
                "first_name": "test192",
                "last_name": "test192",
                "email": "test192@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.571119977Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b762c"
                },
                "first_name": "test184",
                "last_name": "test184",
                "email": "test184@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.580613010Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b762d"
                },
                "first_name": "test197",
                "last_name": "test197",
                "email": "test197@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.614473444Z",
                "is_deleted": false
            },
            {
                "_id": {
                    "$oid": "627165a72e2d4b90b25b762e"
                },
                "first_name": "test204",
                "last_name": "test204",
                "email": "test204@gmail.com",
                "access_level": 1,
                "creation_date": "2022-05-03T17:25:59.632247673Z",
                "is_deleted": false
            }
        ]
    }
}
    #+END_SRC


