docs/documentation.html

<div id="outline-container-orgfd5df43" class="outline-4">
<h4 id="orgfd5df43"><span class="section-number-4">2.1.6.</span> Get users (admin)</h4>
<div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li>note: Gets users accounts filtered by query params</li>
<li>path: /api/users</li>
<li>method: GET</li>
<li>query_params:
<ul class="org-ul">
<li><p>
Deserialized version (no query param is required, all of them are optional):
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c099ff;">pub</span> <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">UserFilter</span> {
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">page</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">u64</span>&gt;,
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">size</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">u64</span>&gt;,
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">first_name</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">String</span>&gt;,
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">last_name</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">String</span>&gt;,
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">email</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">String</span>&gt;,
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">access_level</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">i32</span>&gt;,
    <span style="color: #c099ff;">pub</span> <span style="color: #ff98a4;">access_level_cmp</span>: <span style="color: #ffc777;">Option</span>&lt;<span style="color: #ffc777;">u8</span>&gt;,
}
</pre>
</div>
<ul class="org-ul">
<li>page : page number, defaults to 1</li>
<li>size : page size, defaults to 20</li>
<li>access_level_cmp : compare sign for access_level, (0 or greater than 4, <code>==</code>), (1, &gt;), (2, &gt;=), (3, &lt;), (4, &lt;=)</li>
<li>access_level : user&rsquo;s access level</li>
<li>first_name : looks for any first_name that contains the param</li>
<li>last_name : looks for any first_name that contains the param</li>
<li>email : looks for any first_name that contains the param</li>
</ul></li>
</ul></li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header with admin access level</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"Users retrieved successfully"</span>,
    <span style="color: #c099ff;">"data"</span>: {
        <span style="color: #c099ff;">"page"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
        <span style="color: #c099ff;">"total_count"</span>: <span style="color: #ff995e; font-weight: bold;">836</span>,
        <span style="color: #c099ff;">"data"</span>: [
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b761b"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test178"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test178"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test178@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.389287970Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b761c"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test179"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test179"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test179@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.389724778Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b761d"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test166"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test166"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test166@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.390422573Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b761e"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test177"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test177"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test177@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.391446797Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b761f"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test176"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test176"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test176@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.421910615Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7620"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test186"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test186"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test186@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.440838222Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7621"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test181"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test181"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test181@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.440860209Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7622"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test187"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test187"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test187@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.440871354Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7623"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test183"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test183"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test183@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.454128680Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7624"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test185"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test185"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test185@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.465539934Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7625"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test189"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test189"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test189@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.472019516Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7626"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test180"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test180"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test180@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.472632670Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7627"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test188"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test188"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test188@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.493355320Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7628"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test191"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test191"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test191@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.521922589Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b7629"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test182"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test182"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test182@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.548845077Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b762a"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test193"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test193"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test193@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.569318707Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b762b"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test192"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test192"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test192@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.571119977Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b762c"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test184"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test184"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test184@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.580613010Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b762d"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test197"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test197"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test197@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.614473444Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            },
            {
                <span style="color: #c099ff;">"_id"</span>: {
                    <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"627165a72e2d4b90b25b762e"</span>
                },
                <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test204"</span>,
                <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test204"</span>,
                <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test204@gmail.com"</span>,
                <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
                <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-03T17:25:59.632247673Z"</span>,
                <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
            }
        ]
    }
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
