docs/documentation.org
*** Get one user (admin)
- path: /api/users/{id}
- path_params:
  - id: valid ObjectId string
- method: GET
- header: Authorization Bearer <access_token>
- example 401:
  - invalid token within header
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 404:
  - valid token in header with admin access level
  - valid id, but non existent
  - response:
    #+BEGIN_SRC json
{
    "message": "User does not exist."
}
    #+END_SRC
- example 200:
  - valid token in header with admin access level
  - response:
    #+BEGIN_SRC json
{
    "message": "User retrieved successfully",
    "data": [
        {
            "_id": {
                "$oid": "626fa45c49a4b8812b87c114"
            },
            "first_name": "test0",
            "last_name": "test0",
            "email": "test100@test.com",
            "access_level": 1,
            "creation_date": "2022-05-02T09:29:00.332838625Z",
            "is_deleted": false
        }
    ]
}
    #+END_SRC

*** Get my account (normal user)
- path: /api/users/my_acc
- method: GET
- header: Authorization Bearer <access_token>
- example 401:
  - invalid token within header
  - response:
    #+BEGIN_SRC json
{
    "issues": [
        "You don't have access to this resource"
    ]
}
    #+END_SRC
- example 200:
  - valid token in header
  - response:
    #+BEGIN_SRC json
{
    "message": "Your account was retrieved successfully",
    "data": [
        {
            "_id": {
                "$oid": "62712e0f7e293b13ea85eeee"
            },
            "first_name": "test",
            "last_name": "test",
            "email": "test@test.com",
            "access_level": 1
        }
    ]
}
    #+END_SRC
* GRPC server
** Protocol
    You can find .proto file in projects root inside proto folder. What each message represents is pretty self explanatory.
*** HasAccess
- note_1: this call consumes the token and it won't be valid afterwards
- note_2: Error with invalid_argument status will be returned upon bad path or method
- note_3: Upon internal server error status will be equal to internal
- params:
  - method mus be chosen from Method enum
  - path must have this format "/path/to/something" or "/{name_of_path_param}/rest/of/path/endpoint"
*** GetUser
- note_1: this call won't consume the token and it will be valid afterwards
- note_2: invalid argument will be returned upon bad jwt
