docs/documentation.html


<div id="outline-container-org4fcf78a" class="outline-4">
<h4 id="org4fcf78a"><span class="section-number-4">2.1.7.</span> Get one user (admin)</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>path: /api/users/{id}</li>
<li>path_params:
<ul class="org-ul">
<li>id: valid ObjectId string</li>
</ul></li>
<li>method: GET</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 404:
<ul class="org-ul">
<li>valid token in header with admin access level</li>
<li>valid id, but non existent</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"User does not exist."</span>
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header with admin access level</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"User retrieved successfully"</span>,
    <span style="color: #c099ff;">"data"</span>: [
        {
            <span style="color: #c099ff;">"_id"</span>: {
                <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"626fa45c49a4b8812b87c114"</span>
            },
            <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test0"</span>,
            <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test0"</span>,
            <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test100@test.com"</span>,
            <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>,
            <span style="color: #c099ff;">"creation_date"</span>: <span style="color: #c3e88d;">"2022-05-02T09:29:00.332838625Z"</span>,
            <span style="color: #c099ff;">"is_deleted"</span>: <span style="color: #ff995e;">false</span>
        }
    ]
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb7bd725" class="outline-4">
<h4 id="orgb7bd725"><span class="section-number-4">2.1.8.</span> Get my account (normal user)</h4>
<div class="outline-text-4" id="text-2-1-8">
<ul class="org-ul">
<li>path: /api/users/my_acc</li>
<li>method: GET</li>
<li>header: Authorization Bearer &lt;access_token&gt;</li>
<li>example 401:
<ul class="org-ul">
<li>invalid token within header</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"issues"</span>: [
        <span style="color: #c3e88d;">"You don't have access to this resource"</span>
    ]
}
</pre>
</div></li>
</ul></li>
<li>example 200:
<ul class="org-ul">
<li>valid token in header</li>
<li><p>
response:
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #c099ff;">"message"</span>: <span style="color: #c3e88d;">"Your account was retrieved successfully"</span>,
    <span style="color: #c099ff;">"data"</span>: [
        {
            <span style="color: #c099ff;">"_id"</span>: {
                <span style="color: #c099ff;">"$oid"</span>: <span style="color: #c3e88d;">"62712e0f7e293b13ea85eeee"</span>
            },
            <span style="color: #c099ff;">"first_name"</span>: <span style="color: #c3e88d;">"test"</span>,
            <span style="color: #c099ff;">"last_name"</span>: <span style="color: #c3e88d;">"test"</span>,
            <span style="color: #c099ff;">"email"</span>: <span style="color: #c3e88d;">"test@test.com"</span>,
            <span style="color: #c099ff;">"access_level"</span>: <span style="color: #ff995e; font-weight: bold;">1</span>
        }
    ]
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orge0044c7" class="outline-2">
<h2 id="orge0044c7"><span class="section-number-2">3.</span> GRPC server</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org64862cc" class="outline-3">
<h3 id="org64862cc"><span class="section-number-3">3.1.</span> Protocol</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You can find .proto file in projects root inside proto folder. What each message represents is pretty self explanatory.
</p>
</div>
<div id="outline-container-org349b7ac" class="outline-4">
<h4 id="org349b7ac"><span class="section-number-4">3.1.1.</span> HasAccess</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>note_1: this call consumes the token and it won&rsquo;t be valid afterwards</li>
<li>note_2: Error with invalid_argument status will be returned upon bad path or method</li>
<li>note_3: Upon internal server error status will be equal to internal</li>
<li>params:
<ul class="org-ul">
<li>method mus be chosen from Method enum</li>
<li>path must have this format &ldquo;/path/to/something&rdquo; or &ldquo;/{name_of_path_param}/rest/of/path/endpoint&rdquo;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org046ad1d" class="outline-4">
<h4 id="org046ad1d"><span class="section-number-4">3.1.2.</span> GetUser</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>note_1: this call won&rsquo;t consume the token and it will be valid afterwards</li>
<li>note_2: invalid argument will be returned upon bad jwt</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tooraj Taraz</p>
<p class="date">Created: 2022-05-06 Fri 23:23</p>
</div>
</body>
</html>
